run/validationAnalytical/onsetLiquefaction/constant/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      materialProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

E              E [ 1 -1 -2 0 0 0 0 ] 2.5e6;

nu             nu [ 0 0 0 0 0 0 0 ] 0.35;

k              k [ 0 1 -1 0 0 0 0 ] 1e-6;

K              K [ 1 -1 -2 0 0 0 0 ] 1.9e9;

Sr             Sr [ 0 0 0 0 0 0 0 ] 1;

p0             p0 [ 1 -1 -2 0 0 0 0 ] 186390.0;

gamma          gamma [ 1 -2 -2 0 0 0 0 ] 0.981e4;

n              n [ 0 0 0 0 0 0 0 ] 0.3333;

k0             k0 [0 0 0 0 0 0 0 ] 0.4;

gammaD         gammaD [1 -2 -2 0 0 0 0 ] 1.08e4;

relDensity     relDensity [0 0 0 0 0 0 0] 0.54;

alpha          alpha [0 0 0 0 0 0 0 ] 0.246;

beta           beta [0 0 0 0 0 0 0 ] -0.165;

planeStress     no;

// ************************************************************************* //
